ChibiOS/ChibiOS-Contrib/os/common/ext/CMSIS/Nuvoton/NUMICRO/M251/tk_reg.h
/**************************************************************************//**
 * @file     tk_reg.h
 * @version  V1.00
 * @brief    Touch key register definition header file
 *
 * SPDX-License-Identifier: Apache-2.0
 * @copyright (C) 2020 Nuvoton Technology Corp. All rights reserved.
 *****************************************************************************/

#ifndef __TK_REG_H__
#define __TK_REG_H__

#if defined ( __CC_ARM   )
    #pragma anon_unions
#endif

/**
    @addtogroup REGISTER Control Register
    @{
*/

/**
    @addtogroup TK Touch Key (TK)
    Memory Mapped Structure for TK Controller
    @{
*/

typedef struct
{


    /**
     * @var TK_T::SCANC
     * Offset: 0x00  Touch Key Scan Control Register
     * ---------------------------------------------------------------------------------------------------
     * |Bits    |Field     |Descriptions
     * | :----: | :----:   | :---- |
     * |[0]     |TK0SEN    |TK0 Scan Enable
     * |        |          |This bit is ignored if TK0REN (TK_REFC[0]) is "1" except SCAN_ALL (TK_REFC[23]) is "1".
     * |        |          |0 = TKDAT0 (TK_DAT0[7:0])TK0_DATA is invalid.
     * |        |          |1 = TK0 is always enable for Touch Key scan. TKDAT0 (TK_DAT0[7:0])TK0_DATA is valid.
     * |[1]     |TK1SEN    |TK1 Scan Enable
     * |        |          |This bit is ignored if TK1REN (TK_REFC[1]) is "1".
     * |        |          |0 = TKDAT1 (TK_DAT0[15:8])TK1_DATA is invalid.
     * |        |          |1 = TK1 is always enable for Touch Key scan. TKDAT1 (TK_DAT0[15:8])TK1_DATA is valid.
     * |[2]     |TK2SEN    |TK2 Scan Enable
     * |        |          |This bit is ignored if TK2REN (TK_REFC[2]) is "1".
     * |        |          |0 = TKDAT2 (TK_DAT0[23:16])TK2_DATA is invalid.
     * |        |          |1 = TK2 is always enable for Touch Key scan. TKDAT2 (TK_DAT0[23:16])TK2_DATA is valid.
     * |[3]     |TK3SEN    |TK3 Scan Enable
     * |        |          |0 = TKDAT3 (TK_DAT0[31:24])TK3_DATA is invalid.
     * |        |          |1 = TK3 is always enable for Touch Key scan. TKDAT3 (TK_DAT0[31:24])TK3_DATA is valid.
     * |        |          |This bit is ignored if TK3REN (TK_REFC[3]) is "1".
     * |[4]     |TK4SEN    |TK4 Scan Enable
     * |        |          |This bit is ignored if TK4REN (TK_REFC[4]) is "1".
     * |        |          |0 = TKDAT4 (TK_DAT1[7:0])TK4_DATA is invalid.
     * |        |          |1 = TK4 is always enable for Touch Key scan. TKDAT4 (TK_DAT1[7:0])TK4_DATA is valid.
     * |[5]     |TK5SEN    |TK5 Scan Enable
     * |        |          |This bit is ignored if TK5REN (TK_REFC[5]) is "1".
     * |        |          |0 = TKDAT5 (TK_DAT1[15:8])TK5_DATA is invalid.
     * |        |          |1 = TK5 is always enable for Touch Key scan. TKDAT5 (TK_DAT1[15:8])TK5_DATA is valid.
     * |[6]     |TK6SEN    |TK6 Scan Enable
     * |        |          |This bit is ignored if TK6REN (TK_REFC[6]) is "1".
     * |        |          |0 = TKDAT6 (TK_DAT1[23:16])TK6_DATA is invalid.
     * |        |          |1 = TK6 is always enable for Touch Key scan. TKDAT6 (TK_DAT1[23:16])TK6_DATA is valid.
     * |[7]     |TK7SEN    |TK7 Scan Enable
     * |        |          |This bit is ignored if TK7REN (TK_REFC[7]) is "1".
     * |        |          |0 = TKDAT7 (TK_DAT1[31:24])TK7_DATA is invalid.
     * |        |          |1 = TK7 is always enable for Touch Key scan. TKDAT7 (TK_DAT1[31:24])TK7_DATA is valid.
     * |[8]     |TK8SEN    |TK8 Scan Enable
     * |        |          |This bit is ignored if TK8REN (TK_REFC[8]) is "1".
     * |        |          |0 = TKDAT8 (TK_DAT2[7:0])TK8_DATA is invalid.
     * |        |          |1 = TK8 is always enable for Touch Key scan. TKDAT8 (TK_DAT2[7:0])TK8_DATA is valid.
     * |[9]     |TK9SEN    |TK9 Scan Enable
     * |        |          |This bit is ignored if TK9REN (TK_REFC[9]) is "1".
     * |        |          |0 = TKDAT9 (TK_DAT2[15:8])TK9_DATA is invalid.
     * |        |          |1 = TK9 is always enable for Touch Key scan. TKDAT9 (TK_DAT2[15:8])TK9_DATA is valid.
     * |[10]    |TK10SEN   |TK10 Scan Enable
     * |        |          |This bit is ignored if TK10REN (TK_REFC[10]) is "1".
     * |        |          |0 = TKDAT10 (TK_DAT2[23:16])TK10_DATA is invalid.
     * |        |          |1 = TK10 is always enable for Touch Key scan. TKDAT10 (TK_DAT2[23:16])TK10_DATA is valid.
     * |[11]    |TK11SEN   |TK11 Scan Enable
     * |        |          |This bit is ignored if TK11REN (TK_REFC[11]) is "1".
     * |        |          |0 = TKDAT11 (TK_DAT2[31:24])TK11_DATA is invalid.
     * |        |          |1 = TK11 is always enable for Touch Key scan. TKDAT11 (TK_DAT2[31:24])TK11_DATA is valid.
     * |[12]    |TK12SEN   |TK12 Scan Enable
     * |        |          |This bit is ignored if TK12REN (TK_REFC[12]) is "1".
     * |        |          |0 = TKDAT12 (TK_DAT3[7:0])TK12_DATA is invalid.
     * |        |          |1 = TK12 is always enable for Touch Key scan. TKDAT12 (TK_DAT3[7:0])TK12_DATA is valid.
     * |[13]    |TK13SEN   |TK13 Scan Enable
     * |        |          |This bit is ignored if TK13REN (TK_REFC[13]) is "1".
     * |        |          |0 = TKDAT13 (TK_DAT3[15:8])TK13_DATA is invalid.
     * |        |          |1 = TK13 is always enable for Touch key scan. TKDAT13 (TK_DAT3[15:8])TK13_DATA is valid.
     * |[14]    |TK14SEN   |TK14 Scan Enable
     * |        |          |This bit is ignored if TK14REN (TK_REFC[14]) is "1".
     * |        |          |0 = TKDAT14 (TK_DAT3[23:16])TK14_DATA is invalid.
     * |        |          |1 = TK14 is always enabled for Touch key scan. TKDAT14 (TK_DAT3[23:16])TK14_DATA is valid.
     * |[15]    |TK15SEN   |TK15 Scan Enable
     * |        |          |This bit is ignored if TK15REN (TK_REFC[15]) is "1".
     * |        |          |0 = TKDAT15 (TK_DAT3[31:24])TK15_DATA is invalid.
     * |        |          |1 = TK15 is always enabled for kTouch Key scan. TTKDAT15 (TK_DAT3[31:24])K15_DATA is valid.
     * |[16]    |TK16SEN   |TK16 Scan Enable
     * |        |          |This bit is ignored if TK16REN (TK_REFC[16]) is "1".
     * |        |          |0 = TKDAT16 (TK_DAT4[7:0])16_DATA is invalid.
     * |        |          |1 = TK16 is always enabled for kTouch Key scan. TKDAT16 (TK_DAT4[7:0])TK16_DATA is valid.
     * |[23:20] |AVDDH_S   |AVCCHAVDDH Voltage Select
     * |        |          |0000 = 1/16 VDD.
     * |        |          |0001 = 1/8 VDD.
     * |        |          |0010 = 3/16 VDD.
     * |        |          |0011 = 1/4 VDD.
     * |        |          |0100 = 5/16 VDD.
     * |        |          |0101 = 3/8 VDD.
     * |        |          |0110 = 7/16 VDD.
     * |        |          |0111 = 1/2 VDD.
     * |        |          |1000 = 1/32 VDD.
     * |        |          |1001 = 1/16 VDD.
     * |        |          |1010 = 3/32 VDD.
     * |        |          |1011 = 1/8 VDD.
     * |        |          |1100 = 5/32 VDD.
     * |        |          |1101 = 3/16 VDD.
     * |        |          |1110 = 7/32 VDD.
     * |        |          |1111 = 1/4 VDD.
     * |[24]    |SCAN      |Scan
     * |        |          |Write an "1' to this bit will immediately initiate key scan on all channels which are enabled.
     * |        |          |This bit will be self-cleared after key scan started.
     * |[25]    |TMRTRG_EN |Timer Trigger Enable
     * |        |          |0 = Disable timer to trigger key scan.
     * |        |          |1 = Enable timer triggers key scan periodically
     * |        |          |Touch KKey scan will be initiated by timer periodically.
     * |[31]    |TK_EN     |Touch Key Scan Enable Bit
     * |        |          |0 = Disable Touch Key Function.
     * |        |          |1 = Enable Touch Key Function.
     * @var TK_T::REFC
     * Offset: 0x04  Touch Key Reference Control Register
     * ---------------------------------------------------------------------------------------------------
     * |Bits    |Field     |Descriptions
     * | :----: | :----:   | :---- |
     * |[0]     |TK0REN    |TK0 Reference Enable
     * |        |          |0 = TK0 is not reference.
     * |        |          |1 = TK0 is set as reference, and TKDAT0 (TK_DAT0[7:0])TK0_DATA is invalid
     * |[1]     |TK1REN    |TK1 Reference Enable
     * |        |          |0 = TK1 is not reference.
     * |        |          |1 = TK1 is set as reference, and TKDAT1 (TK_DAT0[15:8])TK1_DATA is invalid.
     * |[2]     |TK2REN    |TK2 Reference Enable
     * |        |          |0 = TK2 is not reference.
     * |        |          |1 = TK2 is set as reference, and TKDAT2 (TK_DAT0[23:16])TK2_DATA is invalid.
     * |[3]     |TK3REN    |TK3 Reference Enable
     * |        |          |0 = TK3 is not reference.
     * |        |          |1 = TK3 is set as reference, and TKDAT3 (TK_DAT0[31:24])TK3_DATA is invalid.
     * |[4]     |TK4REN    |TK4 Reference Enable
     * |        |          |0 = TK4 is not reference.
     * |        |          |1 = TK4 is set as reference, and TKDAT4 (TK_DAT1[7:0])TK4_DATA is invalid.
     * |[5]     |TK5REN    |TK5 Reference Enable
     * |        |          |0 = TK5 is not reference.
     * |        |          |1 = TK5 is set as reference, and TKDAT5 (TK_DAT1[15:8])TK5_DATA is invalid.
     * |[6]     |TK6REN    |TK6 Reference Enable
     * |        |          |0 = TK6 is not reference.
     * |        |          |1 = TK6 is set as reference, and TKDAT6 (TK_DAT1[23:16])TK6_DATA is invalid.
     * |[7]     |TK7REN    |TK7 Reference Enable
     * |        |          |0 = TK7 is not reference.
     * |        |          |1 = TK7 is set as reference, and TKDAT7 (TK_DAT1[31:24])TK7_DATA is invalid.
     * |[8]     |TK8REN    |TK8 Reference Enable
     * |        |          |0 = TK8 is not reference.
     * |        |          |1 = TK8 is set as reference, and TKDAT8 (TK_DAT2[7:0])TK8_DATA is invalid.
     * |[9]     |TK9REN    |TK9 Reference Enable
     * |        |          |0 = TK9 is not reference.
     * |        |          |1 = TK9 is set as reference, and TKDAT9 (TK_DAT2[15:8])TK9_DATA is invalid.
     * |[10]    |TK10REN   |TK10 Reference Enable
     * |        |          |0 = TK10 is not reference.
     * |        |          |1 = TK10 is set as reference, and TKDAT10 (TK_DAT2[23:16])TK10_DATA is invalid.
     * |[11]    |TK11REN   |TK11 Reference Enable
     * |        |          |0 = TK11 is not reference.
     * |        |          |1 = TK11 is set as reference, and TKDAT11 (TK_DAT2[31:24])TK11_DATA is invalid.
     * |[12]    |TK12REN   |TK12 Reference Enable
     * |        |          |0 = TK12 is not reference.
     * |        |          |1 = TK12 is set as reference, and TKDAT12 (TK_DAT3[7:0])TK12_DATA is invalid.
     * |[13]    |TK13REN   |TK13 Reference Enable
     * |        |          |0 = TK13 is not reference.
     * |        |          |1 = TK13 is set as reference, and TKDAT13 (TK_DAT3[15:8])TK13_DATA is invalid.
     * |[14]    |TK14REN   |TK14 Reference Enable
     * |        |          |0 = TK14 is not reference.
     * |        |          |1 = TK14 is set as reference, and TKDAT14 (TK_DAT3[23:16])TK14_DATA is invalid.
     * |[15]    |TK15REN   |TK15 Reference Enable
     * |        |          |0 = TK15 is not reference.
     * |        |          |1 = TK15 is set as reference, and TKDAT15 (TK_DAT3[31:24])TK15_DATA is invalid.
     * |[16]    |TK16REN   |TK16 Reference Enable
     * |        |          |0 = TK16 is not reference.
     * |        |          |1 = TK16 is set as reference, and TKDAT16 (TK_DAT4[7:0])TK16_DATA is invalid.
     * |        |          |Note: This bit is forced to "1" automatically if none is set as reference.
     * |[23]    |SCAN_ALL  |All Keys Scan Enable
     * |        |          |This function is used for low power key scanning operation
     * |        |          |TKDAT_ALL0 (TK_DAT40[157:80]) is the only one valid data when key scan is complete.
     * |        |          |0 = Disable All Keys Scan function.
     * |        |          |1 = Enable All Keys Scan function
     * |        |          |This function is used for low power key scanning operation
     * |        |          |TK0_DATA is the only one valid data when key scan is complete.
     * |[26:24] |SENSET    |Touch Key Sensing Time Control
     * |        |          |000 = 128 x PULSET.
     * |        |          |001 = 255 x PULSET.
     * |        |          |010 = 5111023 x PULSET.
     * |        |          |011 = 10232047 x PULSET.
     * |        |          |100 = 8 x PULSET.
     * |        |          |101 = 16 x PULSET.
     * |        |          |110 = 32 x PULSET.
     * |        |          |111 = 64 x PULSET.
     * |[30:28] |PULSET    |Touch Key Sensing Pulse Width Time Control
     * |        |          |000 = 1us.
     * |        |          |001 = 2us.
     * |        |          |010 = 4us.
     * |        |          |011 = 8us.
     * |        |          |100 = Reserved.
     * |        |          |101 = Reserved.
     * |        |          |110 = 250ns.
     * |        |          |111 = 500ns.
     * @var TK_T::CCBD0
     * Offset: 0x08  Touch Key Complement Capacitor Bank Data Register 0
     * ---------------------------------------------------------------------------------------------------
     * |Bits    |Field     |Descriptions
     * | :----: | :----:   | :---- |
     * |[7:0]   |CCBD0     |TK0 Complement CB Data
     * |        |          |This is register is used for TK0 sensitivity adjustment.
     * |[15:8]  |CCBD1     |TK1 Complement CB Data
     * |        |          |This is register is used for TK1 sensitivity adjustment.
     * |[23:16] |CCBD2     |TK2 Complement CB Data
     * |        |          |This is register is used for TK2 sensitivity adjustment.
     * |[31:24] |CCBD3     |TK3 Complement CB Data
     * |        |          |This is register is used for TK3 sensitivity adjustment.
     * @var TK_T::CCBD1
     * Offset: 0x0C  Touch Key Complement Capacitor Bank Data Register 1
     * ---------------------------------------------------------------------------------------------------
     * |Bits    |Field     |Descriptions
     * | :----: | :----:   | :---- |
     * |[7:0]   |CCBD4     |TK4 Complement CB Data
     * |        |          |This is register is used for TK4 sensitivity adjustment.
     * |[15:8]  |CCBD5     |TK5 Complement CB Data
     * |        |          |This is register is used for TK5 sensitivity adjustment.
     * |[23:16] |CCBD6     |TK6 Complement CB Data
     * |        |          |This is register is used for TK6 sensitivity adjustment.
     * |[31:24] |CCBD7     |TK7 Complement CB Data
     * |        |          |This is register is used for TK7 sensitivity adjustment.
     * @var TK_T::CCBD2
     * Offset: 0x10  Touch Key Complement Capacitor Bank Data Register 2
     * ---------------------------------------------------------------------------------------------------
     * |Bits    |Field     |Descriptions
     * | :----: | :----:   | :---- |
     * |[7:0]   |CCBD8     |TK8 Complement CB Data
     * |        |          |This is register is used for TK8 sensitivity adjustment.
     * |[15:8]  |CCBD9     |TK9 Complement CB Data
     * |        |          |This is register is used for TK9 sensitivity adjustment.
     * |[23:16] |CCBD10    |TK10 Complement CB Data
     * |        |          |This is register is used for TK10 sensitivity adjustment.
     * |[31:24] |CCBD11    |TK11 Complement CB Data
     * |        |          |This is register is used for TK11 sensitivity adjustment.
     * @var TK_T::CCBD3
     * Offset: 0x14  Touch Key Complement Capacitor Bank Data Register 3
     * ---------------------------------------------------------------------------------------------------
     * |Bits    |Field     |Descriptions
     * | :----: | :----:   | :---- |
     * |[7:0]   |CCBD12    |TK12 Complement CB Data
     * |        |          |This is register is used for TK12 sensitivity adjustment.
     * |[15:8]  |CCBD13    |TK13 Complement CB Data
     * |        |          |This is register is used for TK13 sensitivity adjustment.
     * |[23:16] |CCBD14    |TK14 Complement CB Data
     * |        |          |This is register is used for TK14 sensitivity adjustment.
     * |[31:24] |CCBD15    |TK15 Complement CB Data
     * |        |          |This is register is used for TK15 sensitivity adjustment.
     * @var TK_T::CCBD4
     * Offset: 0x18  Touch Key Complement Capacitor Bank Data Register 4
     * ---------------------------------------------------------------------------------------------------
     * |Bits    |Field     |Descriptions
     * | :----: | :----:   | :---- |
     * |[7:0]   |CCBD16    |TK16 Complement CB Data
     * |        |          |This is register is used for TK16 sensitivity adjustment.
     * |[15:8]  |CCBD_ALL  |All Keys Scan Complement CB Data
     * |        |          |This is register is used for All Key Scan sensitivity adjustment.
     * @var TK_T::IDLSC
     * Offset: 0x1C  Touch Key Idle State Control Register
     * ---------------------------------------------------------------------------------------------------
     * |Bits    |Field     |Descriptions
     * | :----: | :----:   | :---- |
     * |[1:0]   |IDLS0     |TK0 Idle State Control
     * |        |          |This register is ignored if both TK0SEN (TK_SCANC[0]) and POLEN0 (TK_POLC[8]) are "0" or TK0REN (TK_REFC[0]) is "1".
     * |        |          |00 = TK0 connected to Gnd.
     * |        |          |01 = TK0 connected to AVCCHAVDDH.
     * |        |          |10 = TK0 connected to VDD.
     * |        |          |11 = TK0 connected to VDD.
     * |[3:2]   |IDLS1     |TK1 Idle State Control
     * |        |          |This register is ignored if both TK1SEN (TK_SCANC[1]) and POLEN1 (TK_POLC[9]) are "0" or TK1REN (TK_REFC[1]) is "1".
     * |        |          |00 = TK1 connected to Gnd.
     * |        |          |01 = TK1 connected to AVCCHAVDDH.
     * |        |          |10 = TK1 connected to VDD.
     * |        |          |11 = TK1 connected to VDD.
     * |[5:4]   |IDLS2     |TK2 Idle State Control
     * |        |          |This register is ignored if both TK2SEN (TK_SCANC[2]) and POLEN2 (TK_POLC[10]) are "0" or TK2REN (TK_REFC[2]) is "1".
     * |        |          |00 = TK2 connected to Gnd.
     * |        |          |01 = TK2 connected to AVCCHAVDDH.
     * |        |          |10 = TK2 connected to VDD.
     * |        |          |11 = TK2 connected to VDD.
     * |[7:6]   |IDLS3     |TK3 Idle State Control
     * |        |          |This register is ignored if both TK3SEN (TK_SCANC[3]) and POLEN3 (TK_POLC[11]) are "0" or TK3REN (TK_REFC[3]) is "1".
     * |        |          |00 = TK3 connected to Gnd.
     * |        |          |01 = TK3 connected to AVCCHAVDDH.
     * |        |          |10 = TK3 connected to VDD.
     * |        |          |11 = TK3 connected to VDD.
     * |[9:8]   |IDLS4     |TK4 Idle State Control
     * |        |          |This register is ignored if both TK4SEN (TK_SCANC[4]) and POLEN4 (TK_POLC[12]) are "0" or TK4REN (TK_REFC[4]) is "1".
     * |        |          |00 = TK4 connected to Gnd.
     * |        |          |01 = TK4 connected to AVCCHAVDDH.
     * |        |          |10 = TK4 connected to VDD.
     * |        |          |11 = TK4 connected to VDD.
     * |[11:10] |IDLS5     |TK5 Idle State Control
     * |        |          |This register is ignored if both TK5SEN (TK_SCANC[5]) and POLEN5 (TK_POLC[13]) are "0" or TK5REN (TK_REFC[5]) is "1".
     * |        |          |00 = TK5 connected to Gnd.
     * |        |          |01 = TK5 connected to AVCCHAVDDH.
     * |        |          |10 = TK5 connected to VDD.
     * |        |          |11 = TK5 connected to VDD.
     * |[13:12] |IDLS6     |TK6 Idle State Control
     * |        |          |This register is ignored if both TK6SEN (TK_SCANC[6]) and POLEN6 (TK_POLC[14]) are "0" or TK6REN (TK_REFC[6]) is "1".
     * |        |          |00 = TK6 connected to Gnd.
     * |        |          |01 = TK6 connected to AVCCHAVDDH.
     * |        |          |10 = TK6 connected to VDD.
     * |        |          |11 = TK6 connected to VDD.
     * |[15:14] |IDLS7     |TK7 Idle State Control
     * |        |          |This register is ignored if both TK7SEN (TK_SCANC[7]) and POLEN7 (TK_POLC[15]) are "0" or TK7REN (TK_REFC[7]) is "1".
     * |        |          |00 = TK7 connected to Gnd.
     * |        |          |01 = TK7 connected to AVCCHAVDDH.
     * |        |          |10 = TK7 connected to VDD.
     * |        |          |11 = TK7 connected to VDD.
     * |[17:16] |IDLS8     |TK8 Idle State Control
     * |        |          |This register is ignored if both TK8SEN (TK_SCANC[8]) and POLEN8 (TK_POLC[16]) are "0" or TK8REN (TK_REFC[8]) is "1".
     * |        |          |00 = TK8 connected to Gnd.
     * |        |          |01 = TK8 connected to AVCCHAVDDH.
     * |        |          |10 = TK8 connected to VDD.
     * |        |          |11 = TK8 connected to VDD.
     * |[19:18] |IDLS9     |TK9 Idle State Control
     * |        |          |This register is ignored if both TK9SEN (TK_SCANC[9]) and POLEN9 (TK_POLC[17]) are "0" or TK9REN (TK_REFC[9]) is "1".
     * |        |          |00 = TK9 connected to Gnd.
     * |        |          |01 = TK9 connected to AVCCHAVDDH.
     * |        |          |10 = TK9 connected to VDD.
     * |        |          |11 = TK9 connected to VDD.
     * |[21:20] |IDLS10    |TK10 Idle State Control
     * |        |          |This register is ignored if both TK10SEN (TK_SCANC[10]) and POLEN10 (TK_POLC[18]) are "0" or TK10REN (TK_REFC[10]) is "1".
     * |        |          |00 = TK10 connected to Gnd.
     * |        |          |01 = TK10 connected to AVCCHAVDDH.
     * |        |          |10 = TK10 connected to VDD.
     * |        |          |11 = TK10 connected to VDD.
     * |[23:22] |IDLS11    |TK11 Idle State Control
     * |        |          |This register is ignored if both TK11SEN (TK_SCANC[11]) and POLEN11 (TK_POLC[19]) are "0" or TK11REN (TK_REFC[11]) is "1".
     * |        |          |00 = TK11 connected to Gnd.
     * |        |          |01 = TK11 connected to AVCCHAVDDH.
     * |        |          |10 = TK11 connected to VDD.
     * |        |          |11 = TK11 connected to VDD.
     * |[25:24] |IDLS12    |TK12 Idle State Control
     * |        |          |This register is ignored if both TK12SEN (TK_SCANC[12]) and POLEN12 (TK_POLC[20]) are "0" or TK12REN (TK_REFC[12]) is "1".
     * |        |          |00 = TK12 connected to Gnd.
     * |        |          |01 = TK12 connected to AVCCHAVDDH.
     * |        |          |10 = TK12 connected to VDD.
     * |        |          |11 = TK12 connected to VDD.
     * |[27:26] |IDLS13    |TK13 Idle State Control
     * |        |          |This register is ignored if both TK13SEN (TK_SCANC[13]) and POLEN13 (TK_POLC[21]) are "0" or TK13REN (TK_REFC[13]) is "1".
     * |        |          |00 = TK13 connected to Gnd.
     * |        |          |01 = TK13 connected to AVCCHAVDDH.
     * |        |          |10 = TK13 connected to VDD.
     * |        |          |11 = TK13 connected to VDD.
     * |[29:28] |IDLS14    |TK14 Idle State Control
     * |        |          |This register is ignored if both TK14SEN (TK_SCANC[14]) and POLEN14 (TK_POLC[22]) are "0" or TK14REN (TK_REFC[14]) is "1".
     * |        |          |00 = TK14 connected to Gnd.
     * |        |          |01 = TK14 connected to AVCCHAVDDH.
     * |        |          |10 = TK14 connected to VDD.
     * |        |          |11 = TK14 connected to VDD.
     * |[31:30] |IDLS15    |TK15 Idle State Control
     * |        |          |This register is ignored if both TK15SEN (TK_SCANC[15]) and POLEN15 (TK_POLC[23]) are "0" or TK15REN (TK_REFC[15]) is "1".
     * |        |          |00 = TK15 connected to Gnd.
     * |        |          |01 = TK15 connected to AVCCHAVDDH.
