ChibiOS/ChibiOS-Contrib/os/common/ext/CMSIS/Nuvoton/NUMICRO/M251/tk_reg.h
     * |        |          |10 = TK15 connected to VDD.
     * |        |          |11 = TK15 connected to VDD.
     * @var TK_T::POLSEL
     * Offset: 0x20  Touch Key Polarity Select Register
     * ---------------------------------------------------------------------------------------------------
     * |Bits    |Field     |Descriptions
     * | :----: | :----:   | :---- |
     * |[1:0]   |POL0      |TK0 Polarity Select
     * |        |          |This register is ignored if POLEN0 (TK_POLC[8]) is "0" or TK0REN (TK_REFC[0]) is "1".
     * |        |          |00 = TK0 connected to Gnd.
     * |        |          |01 = TK0 connected to AVCCHAVDDH.
     * |        |          |10 = TK0 connected to VDD.
     * |        |          |11 = TK0 connected to VDD.
     * |[3:2]   |POL1      |TK1 Polarity Select
     * |        |          |This register is ignored if POLEN1 (TK_POLC[9]) is "0" or TK1REN (TK_REFC[1]) is "1".
     * |        |          |00 = TK1 connected to Gnd.
     * |        |          |01 = TK1 connected to AVCCHAVDDH.
     * |        |          |10 = TK1 connected to VDD.
     * |        |          |11 = TK1 connected to VDD.
     * |[5:4]   |POL2      |TK2 Polarity Select
     * |        |          |This register is ignored if POLEN2 (TK_POLC[10]) is "0" or TK2REN (TK_REFC[2]) is "1".
     * |        |          |00 = TK2 connected to Gnd.
     * |        |          |01 = TK2 connected to AVCCHAVDDH.
     * |        |          |10 = TK2 connected to VDD.
     * |        |          |11 = TK2 connected to VDD.
     * |[7:6]   |POL3      |TK3 Polarity Select
     * |        |          |This register is ignored if POLEN3 (TK_POLC[11]) is "0" or TK3REN (TK_REFC[3]) is "1".
     * |        |          |00 = TK3 connected to Gnd.
     * |        |          |01 = TK3 connected to AVCCHAVDDH.
     * |        |          |10 = TK3 connected to VDD.
     * |        |          |11 = TK3 connected to VDD.
     * |[9:8]   |POL4      |TK4 Polarity Select
     * |        |          |This register is ignored if POLEN4 (TK_POLC[12]) is "0" or TK4REN (TK_REFC[4]) is "1".
     * |        |          |00 = TK4 connected to Gnd.
     * |        |          |01 = TK4 connected to AVCCHAVDDH.
     * |        |          |10 = TK4 connected to VDD.
     * |        |          |11 = TK4 connected to VDD.
     * |[11:10] |POL5      |TK5 Polarity Select
     * |        |          |This register is ignored if POLEN5 (TK_POLC[13]) is "0" or TK5REN (TK_REFC[5]) is "1".
     * |        |          |00 = TK5 connected to Gnd.
     * |        |          |01 = TK5 connected to AVCCHAVDDH.
     * |        |          |10 = TK5 connected to VDD.
     * |        |          |11 = TK5 connected to VDD.
     * |[13:12] |POL6      |TK6 Polarity Select
     * |        |          |This register is ignored if POLEN6 (TK_POLC[14]) is "0" or TK6REN (TK_REFC[6]) is "1".
     * |        |          |00 = TK6 connected to Gnd.
     * |        |          |01 = TK6 connected to AVCCHAVDDH.
     * |        |          |10 = TK6 connected to VDD.
     * |        |          |11 = TK6 connected to VDD.
     * |[15:14] |POL7      |TK7 Polarity Select
     * |        |          |This register is ignored if POLEN7 (TK_POLC[15]) is "0" or TK7REN (TK_REFC[7]) is "1".
     * |        |          |00 = TK7 connected to Gnd.
     * |        |          |01 = TK7 connected to AVCCHAVDDH.
     * |        |          |10 = TK7 connected to VDD.
     * |        |          |11 = TK7 connected to VDD.
     * |[17:16] |POL8      |TK8 Polarity Select
     * |        |          |This register is ignored if POLEN8 (TK_POLC[16]) is "0" or TK8REN (TK_REFC[8]) is "1".
     * |        |          |00 = TK8 connected to Gnd.
     * |        |          |01 = TK8 connected to AVCCHAVDDH.
     * |        |          |10 = TK8 connected to VDD.
     * |        |          |11 = TK8 connected to VDD.
     * |[19:18] |POL9      |TK9 Polarity Select
     * |        |          |This register is ignored if POLEN9 (TK_POLC[17]) is "0" or TK9REN (TK_REFC[9]) is "1".
     * |        |          |00 = TK9 connected to Gnd.
     * |        |          |01 = TK9 connected to AVCCHAVDDH.
     * |        |          |10 = TK9 connected to VDD.
     * |        |          |11 = TK9 connected to VDD.
     * |[21:20] |POL10     |TK10 Polarity Select
     * |        |          |This register is ignored if POLEN10 (TK_POLC[18]) is "0" or TK10REN (TK_REFC[10]) is "1".
     * |        |          |00 = TK10 connected to Gnd.
     * |        |          |01 = TK10 connected to AVCCHAVDDH.
     * |        |          |10 = TK10 connected to VDD.
     * |        |          |11 = TK10 connected to VDD.
     * |[23:22] |POL11     |TK11 Polarity Select
     * |        |          |This register is ignored if POLEN11 (TK_POLC[19]) is "0" or TK11REN (TK_REFC[11]) is "1".
     * |        |          |00 = TK11 connected to Gnd.
     * |        |          |01 = TK11 connected to AVCCHAVDDH.
     * |        |          |10 = TK11 connected to VDD.
     * |        |          |11 = TK11 connected to VDD.
     * |[25:24] |POL12     |TK12 Polarity Select
     * |        |          |This register is ignored if POLEN12 (TK_POLC[20]) is "0" or TK12REN (TK_REFC[12]) is "1".
     * |        |          |00 = TK12 connected to Gnd.
     * |        |          |01 = TK12 connected to AVCCHAVDDH.
     * |        |          |10 = TK12 connected to VDD.
     * |        |          |11 = TK12 connected to VDD.
     * |[27:26] |POL13     |TK13 Polarity Select
     * |        |          |This register is ignored if POLEN13 (TK_POLC[21]) is "0" or TK13REN (TK_REFC[13]) is "1".
     * |        |          |00 = TK13 connected to Gnd.
     * |        |          |01 = TK13 connected to AVCCHAVDDH.
     * |        |          |10 = TK13 connected to VDD.
     * |        |          |11 = TK13 connected to VDD.
     * |[29:28] |POL14     |TK14 Polarity Select
     * |        |          |This register is ignored if POLEN14 (TK_POLC[22]) is "0" or TK14REN (TK_REFC[14]) is "1".
     * |        |          |00 = TK14 connected to Gnd.
     * |        |          |01 = TK14 connected to AVCCHAVDDH.
     * |        |          |10 = TK14 connected to VDD.
     * |        |          |11 = TK14 connected to VDD.
     * |[31:30] |POL15     |TK15 Polarity Select
     * |        |          |This register is ignored if POLEN15 (TK_POLC[23]) is "0" or TK15REN (TK_REFC[15]) is "1".
     * |        |          |00 = TK15 connected to Gnd.
     * |        |          |01 = TK15 connected to AVCCHAVDDH.
     * |        |          |10 = TK15 connected to VDD.
     * |        |          |11 = TK15 connected to VDD.
     * @var TK_T::POLC
     * Offset: 0x24  Touch Key Polarity Control Register
     * ---------------------------------------------------------------------------------------------------
     * |Bits    |Field     |Descriptions
     * | :----: | :----:   | :---- |
     * |[1:0]   |IDLS16    |TK16 Idle State Control
     * |        |          |This register is ignored if both TK16SEN (TK_SCANC[16]) and POLEN16 (TK_POLC[24]) are "0" or TK16REN (TK_REFC[16]) is "1".
     * |        |          |00 = TK16 connected to Gnd.
     * |        |          |01 = TK16 connected to AVCCHAVDDH.
     * |        |          |10 = TK16 connected to VDD.
     * |        |          |11 = TK16 connected to VDD.
     * |[3:2]   |POL16     |TK16 Polarity Control
     * |        |          |This register is ignored if POLEN16 (TK_POLC[24]) is "0" or TK16REN (TK_REFC[16]) is "1".
     * |        |          |00 = TK16 connected to Gnd.
     * |        |          |01 = TK16 connected to AVCCHAVDDH.
     * |        |          |10 = TK16 connected to VDD.
     * |        |          |11 = TK16 connected to VDD.
     * |[5:4]   |POL_CAP   |Capacitor Bank Polarity Select
     * |        |          |00 = Gnd.
     * |        |          |01 = AVCCHAVDDH.
     * |        |          |10 = VDD.
     * |        |          |11 = VDD.
     * |[8]     |POLEN0    |TK0 Polarity Function Enable
     * |        |          |0 = Disable.
     * |        |          |1 = Enable.
     * |[9]     |POLEN1    |TK1 Polarity Function Enable
     * |        |          |0 = Disable.
     * |        |          |1 = Enable.
     * |[10]    |POLEN2    |TK2 Polarity Function Enable
     * |        |          |0 = Disable.
     * |        |          |1 = Enable.
     * |[11]    |POLEN3    |TK3 Polarity Function Enable
     * |        |          |0 = Disable.
     * |        |          |1 = Enable.
     * |[12]    |POLEN4    |TK4 Polarity Function Enable
     * |        |          |0 = Disable.
     * |        |          |1 = Enable.
     * |[13]    |POLEN5    |TK5 Polarity Function Enable
     * |        |          |0 = Disable.
     * |        |          |1 = Enable.
     * |[14]    |POLEN6    |TK6 Polarity Function Enable
     * |        |          |0 = Disable.
     * |        |          |1 = Enable.
     * |[15]    |POLEN7    |TK7 Polarity Function Enable
     * |        |          |0 = Disable.
     * |        |          |1 = Enable.
     * |[16]    |POLEN8    |TK8 Polarity Function Enable
     * |        |          |0 = Disable.
     * |        |          |1 = Enable.
     * |[17]    |POLEN9    |TK9 Polarity Function Enable
     * |        |          |0 = Disable.
     * |        |          |1 = Enable.
     * |[18]    |POLEN10   |TK10 Polarity Function Enable
     * |        |          |0 = Disable.
     * |        |          |1 = Enable.
     * |[19]    |POLEN11   |TK11 Polarity Function Enable
     * |        |          |0 = Disable.
     * |        |          |1 = Enable.
     * |[20]    |POLEN12   |TK12 Polarity Function Enable
     * |        |          |0 = Disable.
     * |        |          |1 = Enable.
     * |[21]    |POLEN13   |TK13 Polarity Function Enable
     * |        |          |0 = Disable.
     * |        |          |1 = Enable.
     * |[22]    |POLEN14   |TK14 Polarity Function Enable
     * |        |          |0 = Disable.
     * |        |          |1 = Enable.
     * |[23]    |POLEN15   |TK15 Polarity Function Enable
     * |        |          |0 = Disable.
     * |        |          |1 = Enable.
     * |[24]    |POLEN16   |TK16 Polarity Function Enable
     * |        |          |0 = Disable.
     * |        |          |1 = Enable.
     * |[31]    |POL_INIT  |Touch Key Sensing Initial Potential Control
     * |        |          |0 = Key pad is connected to Gnd before sensing.
     * |        |          |1 = Key pad is connected to AVCCHAVDDH before sensing.
     * @var TK_T::STA
     * Offset: 0x28  Touch Key Status Register
     * ---------------------------------------------------------------------------------------------------
     * |Bits    |Field     |Descriptions
     * | :----: | :----:   | :---- |
     * |[0]     |BUSY      |Touch Key Busy (Read Only)
     * |        |          |0 = KTouch key sensing scan is complete or stopped.
     * |        |          |1 = KTouch key sensing scan is proceeding.
     * |[1]     |SCIF      |Touch Key Scan Complete Interrupt Flag (Read Only)
     * |        |          |This bit will be cleared by writing a "1" to this bit.
     * |        |          |0 = Touch Keys are being scan is proceeding and data is not ready for read.
     * |        |          |1 = Touch Keys scan is complete and data is ready for read in TKDATx registers.
     * |        |          |Note1: The Touch Key interrupt asserts if SCIE bit of TK_INTEN register is set.
     * |        |          |Note2: The Touch Key interrupt also asserts if STHIE bit of TK_INTEN register is set and any channel data value is greater/less than its threshold setting.
     * |[6]     |TKIF      |Key Scan Interrupt Flag (Read Only)
     * |        |          |0 = No threshold control event with each Keys Scan.
     * |        |          |1 = Threshold control event occurs with each Keys Scan.
     * |        |          |This bit is 1 while any one of TKIF0~TKIF16 is 1.
     * |[7]     |TKIF_ALL  |All Keys Scan Interrupt Flag (Read Only)
     * |        |          |This bit will be cleared by writing a "1" to this bit.
     * |        |          |0 = No threshold control event with All Keys Scan.
     * |        |          |1 = Threshold control event occurs with All Keys Scan.
     * |[8]     |TKIF0     |TK0 Interrupt Flag (Read Only)
     * |        |          |This bit will be cleared by writing a "1" to this bit.
     * |        |          |0 = No threshold control event with TK0.
     * |        |          |1 = Threshold control event occurs with TK0.
     * |[9]     |TKIF1     |TK1 Interrupt Flag (Read Only)
     * |        |          |This bit will be cleared by writing a "1" to this bit.
     * |        |          |0 = No threshold control event with TK1.
     * |        |          |1 = Threshold control event occurs with TK1.
     * |[10]    |TKIF2     |TK2 Interrupt Flag (Read Only)
     * |        |          |This bit will be cleared by writing a "1" to this bit.
     * |        |          |0 = No threshold control event with TK2.
     * |        |          |1 = Threshold control event occurs with TK2.
     * |[11]    |TKIF3     |TK3 Interrupt Flag (Read Only)
     * |        |          |This bit will be cleared by writing a "1" to this bit.
     * |        |          |0 = No threshold control event with TK3.
     * |        |          |1 = Threshold control event occurs with TK3.
     * |[12]    |TKIF4     |TK4 Interrupt Flag (Read Only)
     * |        |          |This bit will be cleared by writing a "1" to this bit.
     * |        |          |0 = No threshold control event with TK4.
     * |        |          |1 = Threshold control event occurs with TK4.
     * |[13]    |TKIF5     |TK5 Interrupt Flag (Read Only)
     * |        |          |This bit will be cleared by writing a "1" to this bit.
     * |        |          |0 = No threshold control event with TK5.
     * |        |          |1 = Threshold control event occurs with TK5.
     * |[14]    |TKIF6     |TK6 Interrupt Flag (Read Only)
     * |        |          |This bit will be cleared by writing a "1" to this bit.
     * |        |          |0 = No threshold control event with TK6.
     * |        |          |1 = Threshold control event occurs with TK6.
     * |[15]    |TKIF7     |TK7 Interrupt Flag (Read Only)
     * |        |          |This bit will be cleared by writing a "1" to this bit.
     * |        |          |0 = No threshold control event with TK7.
     * |        |          |1 = Threshold control event occurs with TK7.
     * |[16]    |TKIF8     |TK8 Interrupt Flag (Read Only)
     * |        |          |This bit will be cleared by writing a "1" to this bit.
     * |        |          |0 = No threshold control event with TK8.
     * |        |          |1 = Threshold control event occurs with TK8.
     * |[17]    |TKIF9     |TK9 Interrupt Flag (Read Only)
     * |        |          |This bit will be cleared by writing a "1" to this bit.
     * |        |          |0 = No threshold control event with TK9.
     * |        |          |1 = Threshold control event occurs with TK9.
     * |[18]    |TKIF10    |TK10 Interrupt Flag (Read Only)
     * |        |          |This bit will be cleared by writing a "1" to this bit.
     * |        |          |0 = No threshold control event with TK10.
     * |        |          |1 = Threshold control event occurs with TK10.
     * |[19]    |TKIF11    |TK11 Interrupt Flag (Read Only)
     * |        |          |This bit will be cleared by writing a "1" to this bit.
     * |        |          |0 = No threshold control event with TK11.
     * |        |          |1 = Threshold control event occurs with TK11.
     * |[20]    |TKIF12    |TK12 Interrupt Flag (Read Only)
     * |        |          |This bit will be cleared by writing a "1" to this bit.
     * |        |          |0 = No threshold control event with TK12.
     * |        |          |1 = Threshold control event occurs with TK12.
     * |[21]    |TKIF13    |TK13 Interrupt Flag (Read Only)
     * |        |          |This bit will be cleared by writing a "1" to this bit.
     * |        |          |0 = No threshold control event with TK13.
     * |        |          |1 = Threshold control event occurs with TK13.
     * |[22]    |TKIF14    |TK14 Interrupt Flag (Read Only)
     * |        |          |This bit will be cleared by writing a "1" to this bit.
     * |        |          |0 = No threshold control event with TK14.
     * |        |          |1 = Threshold control event occurs with TK14.
     * |[23]    |TKIF15    |TK15 Interrupt Flag (Read Only)
     * |        |          |This bit will be cleared by writing a "1" to this bit.
     * |        |          |0 = No threshold control event with TK15.
     * |        |          |1 = Threshold control event occurs with TK15.
     * |[24]    |TKIF16    |TK16 Interrupt Flag (Read Only)
     * |        |          |This bit will be cleared by writing a "1" to this bit.
     * |        |          |0 = No threshold control event with TK16.
     * |        |          |1 = Threshold control event occurs with TK16.
     * @var TK_T::DAT0
     * Offset: 0x2C  Touch Key Data Register 0
     * ---------------------------------------------------------------------------------------------------
     * |Bits    |Field     |Descriptions
     * | :----: | :----:   | :---- |
     * |[7:0]   |TKDAT0    |TK0 Sensing Result Data (Read Only)
     * |        |          |This data is invalid if TK0SEN (TK_SCANC[0]) is "0" or TK0REN (TK_REFC[0]) is "1" except SCAN_ALL (TK_REFC[23]) is "1".
     * |[15:8]  |TKDAT1    |TK1 Sensing Result Data (Read Only)
     * |        |          |This data is invalid if TK1SEN (TK_SCANC[1]) is "0" or TK1REN (TK_REFC[1]) is "1".
     * |[23:16] |TKDAT2    |TK2 Sensing Result Data (Read Only)
     * |        |          |This data is invalid if TK2SEN (TK_SCANC[2]) is "0" or TK2REN (TK_REFC[2]) is "1".
     * |[31:24] |TKDAT3    |TK3 Sensing Result Data (Read Only)
     * |        |          |This data is invalid if TK3SEN (TK_SCANC[3]) is "0" or TK3REN (TK_REFC[3]) is "1".
     * @var TK_T::DAT1
     * Offset: 0x30  Touch Key Data Register 1
     * ---------------------------------------------------------------------------------------------------
     * |Bits    |Field     |Descriptions
     * | :----: | :----:   | :---- |
     * |[7:0]   |TKDAT4    |TK0 Sensing Result Data (Read Only)
     * |        |          |This data is invalid if TK4SEN (TK_SCANC[4]) is "0" or TK4REN (TK_REFC[4]) is "1".
     * |[15:8]  |TKDAT5    |TK5 Sensing Result Data (Read Only)
     * |        |          |This data is invalid if TK5SEN (TK_SCANC[5]) is "0" or TK5REN (TK_REFC[5]) is "1".
     * |[23:16] |TKDAT6    |TK6 Sensing Result Data (Read Only)
     * |        |          |This data is invalid if TK6SEN (TK_SCANC[6]) is "0" or TK6REN (TK_REFC[6]) is "1".
     * |[31:24] |TKDAT7    |TK7 Sensing Result Data (Read Only)
     * |        |          |This data is invalid if TK7SEN (TK_SCANC[7]) is "0" or TK7REN (TK_REFC[7]) is "1".
     * @var TK_T::DAT2
     * Offset: 0x34  Touch Key Data Register 2
     * ---------------------------------------------------------------------------------------------------
     * |Bits    |Field     |Descriptions
     * | :----: | :----:   | :---- |
     * |[7:0]   |TKDAT8    |TK8 Sensing Result Data (Read Only)
     * |        |          |This data is invalid if TK8SEN (TK_SCANC[8]) is "0" or TK8REN (TK_REFC[8]) is "1".
     * |[15:8]  |TKDAT9    |TK9 Sensing Result Data (Read Only)
     * |        |          |This data is invalid if TK9SEN (TK_SCANC[9]) is "0" or TK9REN (TK_REFC[9]) is "1".
     * |[23:16] |TKDAT10   |TK10 Sensing Result Data (Read Only)
     * |        |          |This data is invalid if TK10SEN (TK_SCANC[10]) is "0" or TK10REN (TK_REFC[10]) is "1".
     * |[31:24] |TKDAT11   |TK11 Sensing Result Data (Read Only)
     * |        |          |This data is invalid if TK11SEN (TK_SCANC[11]) is "0" or TK11REN (TK_REFC[11]) is "1".
     * @var TK_T::DAT3
     * Offset: 0x38  Touch Key Data Register 3
     * ---------------------------------------------------------------------------------------------------
     * |Bits    |Field     |Descriptions
     * | :----: | :----:   | :---- |
     * |[7:0]   |TKDAT12   |TK12 Sensing Result Data (Read Only)
     * |        |          |This data is invalid if TK12SEN (TK_SCANC[12]) is "0" or TK12REN (TK_REFC[12]) is "1".
     * |[15:8]  |TKDAT13   |TK13 Sensing Result Data (Read Only)
     * |        |          |This data is invalid if TK13SEN (TK_SCANC[13]) is "0" or TK13REN (TK_REFC[13]) is "1".
     * |[23:16] |TKDAT14   |TK14 Sensing Result Data (Read Only)
     * |        |          |This data is invalid if TK14SEN (TK_SCANC[14]) is "0" or TK14REN (TK_REFC[14]) is "1".
     * |[31:24] |TKDAT15   |TK15 Sensing Result Data (Read Only)
     * |        |          |This data is invalid if TK15SEN (TK_SCANC[15]) is "0" or TK15REN (TK_REFC[15]) is "1".
     * @var TK_T::DAT4
     * Offset: 0x3C  Touch Key Data Register 4
     * ---------------------------------------------------------------------------------------------------
     * |Bits    |Field     |Descriptions
     * | :----: | :----:   | :---- |
     * |[7:0]   |TKDAT16   |TK16 Sensing Result Data (Read Only)
     * |        |          |This data is invalid if TK16SEN (TK_SCANC[16]) is "0" or TK16REN (TK_REFC[16]) is "1".
     * |[15:8]  |TKDAT_ALL |All Keys Scan Sensing Result Data (Read Only)
     * |        |          |This data is invalid if SCAN_ALL (TK_REFC[23]) is "0".
     * @var TK_T::INTEN
     * Offset: 0x40  Touch Key Interrupt Enable Register
     * ---------------------------------------------------------------------------------------------------
     * |Bits    |Field     |Descriptions
     * | :----: | :----:   | :---- |
     * |[0]     |SCTHIE    |Touch Key Scan Complete with High/Low Threshold Control Interrupt Enable
     * |        |          |0 = KTouch key Scan scan Complete complete with threshold control interrupt is disable.
     * |        |          |1 = KTouch key Scan scan Complete complete with threshold control interrupt is enable.
     * |[1]     |SCIE      |Touch Key Scan Complete Interrupt Enable
     * |        |          |0 = KTouch key sScan cComplete without threshold control interrupt is disable.
     * |        |          |1 = KTouch key sScan cComplete without threshold control interrupt is enable.
     * @var TK_T::THC01
     * Offset: 0x44  Touch Key TK0/TK1 Threshold Control Register
     * ---------------------------------------------------------------------------------------------------
     * |Bits    |Field     |Descriptions
     * | :----: | :----:   | :---- |
     * |[15:8]  |HTH0      |High Threshold of TK0
     * |        |          |High level for TK0 threshold control.
     * |[31:24] |HTH1      |High Threshold of TK1
     * |        |          |High level for TK1 threshold control.
     * @var TK_T::THC23
     * Offset: 0x48  Touch Key TK2/TK3 Threshold Control Register
     * ---------------------------------------------------------------------------------------------------
     * |Bits    |Field     |Descriptions
     * | :----: | :----:   | :---- |
     * |[15:8]  |HTH2      |High Threshold of TK2
     * |        |          |High level for TK2 threshold control.
     * |[31:24] |HTH3      |High Threshold of TK3
     * |        |          |High level for TK3 threshold control.
     * @var TK_T::THC45
     * Offset: 0x4C  Touch Key TK4/TK5 Threshold Control Register
     * ---------------------------------------------------------------------------------------------------
     * |Bits    |Field     |Descriptions
     * | :----: | :----:   | :---- |
     * |[15:8]  |HTH4      |High Threshold of TK4
     * |        |          |High level for TK4 threshold control.
     * |[31:24] |HTH5      |High Threshold of TK5
