ChibiOS/ChibiOS-Contrib/os/common/ext/CMSIS/Nuvoton/NUMICRO/M251/tk_reg.h
#define TK_IDLSC1_IDLS19_Pos             (4)                                               /*!< TK_T::IDLSC1: IDLS19 Position          */
#define TK_IDLSC1_IDLS19_Msk             (0x3ul << TK_IDLSC1_IDLS19_Pos)                   /*!< TK_T::IDLSC1: IDLS19 Mask              */

#define TK_IDLSC1_IDLS20_Pos             (6)                                               /*!< TK_T::IDLSC1: IDLS20 Position          */
#define TK_IDLSC1_IDLS20_Msk             (0x3ul << TK_IDLSC1_IDLS20_Pos)                   /*!< TK_T::IDLSC1: IDLS20 Mask              */

#define TK_IDLSC1_IDLS21_Pos             (8)                                               /*!< TK_T::IDLSC1: IDLS21 Position          */
#define TK_IDLSC1_IDLS21_Msk             (0x3ul << TK_IDLSC1_IDLS21_Pos)                   /*!< TK_T::IDLSC1: IDLS21 Mask              */

#define TK_IDLSC1_IDLS22_Pos             (10)                                              /*!< TK_T::IDLSC1: IDLS22 Position          */
#define TK_IDLSC1_IDLS22_Msk             (0x3ul << TK_IDLSC1_IDLS22_Pos)                   /*!< TK_T::IDLSC1: IDLS22 Mask              */

#define TK_IDLSC1_IDLS23_Pos             (12)                                              /*!< TK_T::IDLSC1: IDLS23 Position          */
#define TK_IDLSC1_IDLS23_Msk             (0x3ul << TK_IDLSC1_IDLS23_Pos)                   /*!< TK_T::IDLSC1: IDLS23 Mask              */

#define TK_IDLSC1_IDLS24_Pos             (14)                                              /*!< TK_T::IDLSC1: IDLS24 Position          */
#define TK_IDLSC1_IDLS24_Msk             (0x3ul << TK_IDLSC1_IDLS24_Pos)                   /*!< TK_T::IDLSC1: IDLS24 Mask              */

#define TK_IDLSC1_IDLS25_Pos             (16)                                              /*!< TK_T::IDLSC1: IDLS25 Position          */
#define TK_IDLSC1_IDLS25_Msk             (0x3ul << TK_IDLSC1_IDLS25_Pos)                   /*!< TK_T::IDLSC1: IDLS25 Mask              */

#define TK_POLSEL_POL0_Pos               (0)                                               /*!< TK_T::POLSEL: POL0 Position            */
#define TK_POLSEL_POL0_Msk               (0x3ul << TK_POLSEL_POL0_Pos)                     /*!< TK_T::POLSEL: POL0 Mask                */

#define TK_POLSEL_POL1_Pos               (2)                                               /*!< TK_T::POLSEL: POL1 Position            */
#define TK_POLSEL_POL1_Msk               (0x3ul << TK_POLSEL_POL1_Pos)                     /*!< TK_T::POLSEL: POL1 Mask                */

#define TK_POLSEL_POL2_Pos               (4)                                               /*!< TK_T::POLSEL: POL2 Position            */
#define TK_POLSEL_POL2_Msk               (0x3ul << TK_POLSEL_POL2_Pos)                     /*!< TK_T::POLSEL: POL2 Mask                */

#define TK_POLSEL_POL3_Pos               (6)                                               /*!< TK_T::POLSEL: POL3 Position            */
#define TK_POLSEL_POL3_Msk               (0x3ul << TK_POLSEL_POL3_Pos)                     /*!< TK_T::POLSEL: POL3 Mask                */

#define TK_POLSEL_POL4_Pos               (8)                                               /*!< TK_T::POLSEL: POL4 Position            */
#define TK_POLSEL_POL4_Msk               (0x3ul << TK_POLSEL_POL4_Pos)                     /*!< TK_T::POLSEL: POL4 Mask                */

#define TK_POLSEL_POL5_Pos               (10)                                              /*!< TK_T::POLSEL: POL5 Position            */
#define TK_POLSEL_POL5_Msk               (0x3ul << TK_POLSEL_POL5_Pos)                     /*!< TK_T::POLSEL: POL5 Mask                */

#define TK_POLSEL_POL6_Pos               (12)                                              /*!< TK_T::POLSEL: POL6 Position            */
#define TK_POLSEL_POL6_Msk               (0x3ul << TK_POLSEL_POL6_Pos)                     /*!< TK_T::POLSEL: POL6 Mask                */

#define TK_POLSEL_POL7_Pos               (14)                                              /*!< TK_T::POLSEL: POL7 Position            */
#define TK_POLSEL_POL7_Msk               (0x3ul << TK_POLSEL_POL7_Pos)                     /*!< TK_T::POLSEL: POL7 Mask                */

#define TK_POLSEL_POL8_Pos               (16)                                              /*!< TK_T::POLSEL: POL8 Position            */
#define TK_POLSEL_POL8_Msk               (0x3ul << TK_POLSEL_POL8_Pos)                     /*!< TK_T::POLSEL: POL8 Mask                */

#define TK_POLSEL_POL9_Pos               (18)                                              /*!< TK_T::POLSEL: POL9 Position            */
#define TK_POLSEL_POL9_Msk               (0x3ul << TK_POLSEL_POL9_Pos)                     /*!< TK_T::POLSEL: POL9 Mask                */

#define TK_POLSEL_POL10_Pos              (20)                                              /*!< TK_T::POLSEL: POL10 Position           */
#define TK_POLSEL_POL10_Msk              (0x3ul << TK_POLSEL_POL10_Pos)                    /*!< TK_T::POLSEL: POL10 Mask               */

#define TK_POLSEL_POL11_Pos              (22)                                              /*!< TK_T::POLSEL: POL11 Position           */
#define TK_POLSEL_POL11_Msk              (0x3ul << TK_POLSEL_POL11_Pos)                    /*!< TK_T::POLSEL: POL11 Mask               */

#define TK_POLSEL_POL12_Pos              (24)                                              /*!< TK_T::POLSEL: POL12 Position           */
#define TK_POLSEL_POL12_Msk              (0x3ul << TK_POLSEL_POL12_Pos)                    /*!< TK_T::POLSEL: POL12 Mask               */

#define TK_POLSEL_POL13_Pos              (26)                                              /*!< TK_T::POLSEL: POL13 Position           */
#define TK_POLSEL_POL13_Msk              (0x3ul << TK_POLSEL_POL13_Pos)                    /*!< TK_T::POLSEL: POL13 Mask               */

#define TK_POLSEL_POL14_Pos              (28)                                              /*!< TK_T::POLSEL: POL14 Position           */
#define TK_POLSEL_POL14_Msk              (0x3ul << TK_POLSEL_POL14_Pos)                    /*!< TK_T::POLSEL: POL14 Mask               */

#define TK_POLSEL_POL15_Pos              (30)                                              /*!< TK_T::POLSEL: POL15 Position           */
#define TK_POLSEL_POL15_Msk              (0x3ul << TK_POLSEL_POL15_Pos)                    /*!< TK_T::POLSEL: POL15 Mask               */

#define TK_POLC_IDLS16_Pos               (0)                                               /*!< TK_T::POLC: IDLS16 Position            */
#define TK_POLC_IDLS16_Msk               (0x3ul << TK_POLC_IDLS16_Pos)                     /*!< TK_T::POLC: IDLS16 Mask                */

#define TK_POLC_POL16_Pos                (2)                                               /*!< TK_T::POLC: POL16 Position             */
#define TK_POLC_POL16_Msk                (0x3ul << TK_POLC_POL16_Pos)                      /*!< TK_T::POLC: POL16 Mask                 */

#define TK_POLSEL1_POL17_Pos             (0)                                               /*!< TK_T::POLSEL1: POL17 Position          */
#define TK_POLSEL1_POL17_Msk             (0x3ul << TK_POLSEL1_POL17_Pos)                   /*!< TK_T::POLSEL1: POL17 Mask              */

#define TK_POLSEL1_POL18_Pos             (2)                                               /*!< TK_T::POLSEL1: POL18 Position          */
#define TK_POLSEL1_POL18_Msk             (0x3ul << TK_POLSEL1_POL18_Pos)                   /*!< TK_T::POLSEL1: POL18 Mask              */

