ChibiOS/ChibiOS-Contrib/os/common/ext/CMSIS/Nuvoton/NUMICRO/M251/tk_reg.h
#define TK_POLC_POLEN16_Pos              (24)                                              /*!< TK_T::POLC: POLEN16 Position           */
#define TK_POLC_POLEN16_Msk              (0x1ul << TK_POLC_POLEN16_Pos)                    /*!< TK_T::POLC: POLEN16 Mask               */

#define TK_POLC1_POLEN17_Pos             (0)                                               /*!< TK_T::POLC1: POLEN17 Position          */
#define TK_POLC1_POLEN17_Msk             (0x1ul << TK_POLC1_POLEN17_Pos)                   /*!< TK_T::POLC1: POLEN17 Mask              */

#define TK_POLC1_POLEN18_Pos             (1)                                               /*!< TK_T::POLC1: POLEN18 Position          */
#define TK_POLC1_POLEN18_Msk             (0x1ul << TK_POLC1_POLEN18_Pos)                   /*!< TK_T::POLC1: POLEN18 Mask              */

#define TK_POLC1_POLEN19_Pos             (2)                                               /*!< TK_T::POLC1: POLEN19 Position          */
#define TK_POLC1_POLEN19_Msk             (0x1ul << TK_POLC1_POLEN19_Pos)                   /*!< TK_T::POLC1: POLEN19 Mask              */

#define TK_POLC1_POLEN20_Pos             (3)                                               /*!< TK_T::POLC1: POLEN20 Position          */
#define TK_POLC1_POLEN20_Msk             (0x1ul << TK_POLC1_POLEN20_Pos)                   /*!< TK_T::POLC1: POLEN20 Mask              */

#define TK_POLC1_POLEN21_Pos             (4)                                               /*!< TK_T::POLC1: POLEN21 Position          */
#define TK_POLC1_POLEN21_Msk             (0x1ul << TK_POLC1_POLEN21_Pos)                   /*!< TK_T::POLC1: POLEN21 Mask              */

#define TK_POLC1_POLEN22_Pos             (5)                                               /*!< TK_T::POLC1: POLEN22 Position          */
#define TK_POLC1_POLEN22_Msk             (0x1ul << TK_POLC1_POLEN22_Pos)                   /*!< TK_T::POLC1: POLEN22 Mask              */

#define TK_POLC1_POLEN23_Pos             (6)                                               /*!< TK_T::POLC1: POLEN23 Position          */
#define TK_POLC1_POLEN23_Msk             (0x1ul << TK_POLC1_POLEN23_Pos)                   /*!< TK_T::POLC1: POLEN23 Mask              */

#define TK_POLC1_POLEN24_Pos             (7)                                               /*!< TK_T::POLC1: POLEN24 Position          */
#define TK_POLC1_POLEN24_Msk             (0x1ul << TK_POLC1_POLEN24_Pos)                   /*!< TK_T::POLC1: POLEN24 Mask              */

#define TK_POLC1_POLEN25_Pos             (8)                                               /*!< TK_T::POLC1: POLEN25 Position          */
#define TK_POLC1_POLEN25_Msk             (0x1ul << TK_POLC1_POLEN25_Pos)                   /*!< TK_T::POLC1: POLEN25 Mask              */

#define TK_POLC_POL_INIT_Pos             (31)                                              /*!< TK_T::POLC: POL_INIT Position          */
#define TK_POLC_POL_INIT_Msk             (0x1ul << TK_POLC_POL_INIT_Pos)                   /*!< TK_T::POLC: POL_INIT Mask              */

#define TK_STA_BUSY_Pos                  (0)                                               /*!< TK_T::STA: BUSY Position               */
#define TK_STA_BUSY_Msk                  (0x1ul << TK_STA_BUSY_Pos)                        /*!< TK_T::STA: BUSY Mask                   */

#define TK_STA_SCIF_Pos                  (1)                                               /*!< TK_T::STA: SCIF Position               */
#define TK_STA_SCIF_Msk                  (0x1ul << TK_STA_SCIF_Pos)                        /*!< TK_T::STA: SCIF Mask                   */

#define TK_STA_TKIF_Pos                  (6)                                               /*!< TK_T::STA: TKIF Position               */
#define TK_STA_TKIF_Msk                  (0x1ul << TK_STA_TKIF_Pos)                        /*!< TK_T::STA: TKIF Mask                   */

#define TK_STA_TKIF_ALL_Pos              (7)                                               /*!< TK_T::STA: TKIF_ALL Position           */
#define TK_STA_TKIF_ALL_Msk              (0x1ul << TK_STA_TKIF_ALL_Pos)                    /*!< TK_T::STA: TKIF_ALL Mask               */

#define TK_STA_TKIF0_Pos                 (8)                                               /*!< TK_T::STA: TKIF0 Position              */
#define TK_STA_TKIF0_Msk                 (0x1ul << TK_STA_TKIF0_Pos)                       /*!< TK_T::STA: TKIF0 Mask                  */

#define TK_STA_TKIF1_Pos                 (9)                                               /*!< TK_T::STA: TKIF1 Position              */
#define TK_STA_TKIF1_Msk                 (0x1ul << TK_STA_TKIF1_Pos)                       /*!< TK_T::STA: TKIF1 Mask                  */

#define TK_STA_TKIF2_Pos                 (10)                                              /*!< TK_T::STA: TKIF2 Position              */
#define TK_STA_TKIF2_Msk                 (0x1ul << TK_STA_TKIF2_Pos)                       /*!< TK_T::STA: TKIF2 Mask                  */

#define TK_STA_TKIF3_Pos                 (11)                                              /*!< TK_T::STA: TKIF3 Position              */
#define TK_STA_TKIF3_Msk                 (0x1ul << TK_STA_TKIF3_Pos)                       /*!< TK_T::STA: TKIF3 Mask                  */

#define TK_STA_TKIF4_Pos                 (12)                                              /*!< TK_T::STA: TKIF4 Position              */
#define TK_STA_TKIF4_Msk                 (0x1ul << TK_STA_TKIF4_Pos)                       /*!< TK_T::STA: TKIF4 Mask                  */

#define TK_STA_TKIF5_Pos                 (13)                                              /*!< TK_T::STA: TKIF5 Position              */
#define TK_STA_TKIF5_Msk                 (0x1ul << TK_STA_TKIF5_Pos)                       /*!< TK_T::STA: TKIF5 Mask                  */

#define TK_STA_TKIF6_Pos                 (14)                                              /*!< TK_T::STA: TKIF6 Position              */
#define TK_STA_TKIF6_Msk                 (0x1ul << TK_STA_TKIF6_Pos)                       /*!< TK_T::STA: TKIF6 Mask                  */

