ChibiOS/ChibiOS-Contrib/os/common/ext/CMSIS/Nuvoton/NUMICRO/M251/tk_reg.h
#define TK_STA_TKIF7_Pos                 (15)                                              /*!< TK_T::STA: TKIF7 Position              */
#define TK_STA_TKIF7_Msk                 (0x1ul << TK_STA_TKIF7_Pos)                       /*!< TK_T::STA: TKIF7 Mask                  */

#define TK_STA_TKIF8_Pos                 (16)                                              /*!< TK_T::STA: TKIF8 Position              */
#define TK_STA_TKIF8_Msk                 (0x1ul << TK_STA_TKIF8_Pos)                       /*!< TK_T::STA: TKIF8 Mask                  */

#define TK_STA_TKIF9_Pos                 (17)                                              /*!< TK_T::STA: TKIF9 Position              */
#define TK_STA_TKIF9_Msk                 (0x1ul << TK_STA_TKIF9_Pos)                       /*!< TK_T::STA: TKIF9 Mask                  */

#define TK_STA_TKIF10_Pos                (18)                                              /*!< TK_T::STA: TKIF10 Position             */
#define TK_STA_TKIF10_Msk                (0x1ul << TK_STA_TKIF10_Pos)                      /*!< TK_T::STA: TKIF10 Mask                 */

#define TK_STA_TKIF11_Pos                (19)                                              /*!< TK_T::STA: TKIF11 Position             */
#define TK_STA_TKIF11_Msk                (0x1ul << TK_STA_TKIF11_Pos)                      /*!< TK_T::STA: TKIF11 Mask                 */

#define TK_STA_TKIF12_Pos                (20)                                              /*!< TK_T::STA: TKIF12 Position             */
#define TK_STA_TKIF12_Msk                (0x1ul << TK_STA_TKIF12_Pos)                      /*!< TK_T::STA: TKIF12 Mask                 */

#define TK_STA_TKIF13_Pos                (21)                                              /*!< TK_T::STA: TKIF13 Position             */
#define TK_STA_TKIF13_Msk                (0x1ul << TK_STA_TKIF13_Pos)                      /*!< TK_T::STA: TKIF13 Mask                 */

#define TK_STA_TKIF14_Pos                (22)                                              /*!< TK_T::STA: TKIF14 Position             */
#define TK_STA_TKIF14_Msk                (0x1ul << TK_STA_TKIF14_Pos)                      /*!< TK_T::STA: TKIF14 Mask                 */

#define TK_STA_TKIF15_Pos                (23)                                              /*!< TK_T::STA: TKIF15 Position             */
#define TK_STA_TKIF15_Msk                (0x1ul << TK_STA_TKIF15_Pos)                      /*!< TK_T::STA: TKIF15 Mask                 */

#define TK_STA_TKIF16_Pos                (24)                                              /*!< TK_T::STA: TKIF16 Position             */
#define TK_STA_TKIF16_Msk                (0x1ul << TK_STA_TKIF16_Pos)                      /*!< TK_T::STA: TKIF16 Mask                 */

#define TK_STA_TKIF17_Pos                (0)                                               /*!< TK_T::STA: TKIF17 Position             */
#define TK_STA_TKIF17_Msk                (0x1ul << TK_STA_TKIF17_Pos)                      /*!< TK_T::STA: TKIF17 Mask                 */

#define TK_STA_TKIF18_Pos                (1)                                               /*!< TK_T::STA: TKIF18 Position             */
#define TK_STA_TKIF18_Msk                (0x1ul << TK_STA_TKIF18_Pos)                      /*!< TK_T::STA: TKIF18 Mask                 */

#define TK_STA_TKIF19_Pos                (2)                                               /*!< TK_T::STA: TKIF19 Position             */
#define TK_STA_TKIF19_Msk                (0x1ul << TK_STA_TKIF19_Pos)                      /*!< TK_T::STA: TKIF19 Mask                 */

#define TK_STA_TKIF20_Pos                (3)                                               /*!< TK_T::STA: TKIF20 Position             */
#define TK_STA_TKIF20_Msk                (0x1ul << TK_STA_TKIF20_Pos)                      /*!< TK_T::STA: TKIF20 Mask                 */

#define TK_STA_TKIF21_Pos                (4)                                               /*!< TK_T::STA: TKIF21 Position             */
#define TK_STA_TKIF21_Msk                (0x1ul << TK_STA_TKIF21_Pos)                      /*!< TK_T::STA: TKIF21 Mask                 */

#define TK_STA_TKIF22_Pos                (5)                                               /*!< TK_T::STA: TKIF22 Position             */
#define TK_STA_TKIF22_Msk                (0x1ul << TK_STA_TKIF22_Pos)                      /*!< TK_T::STA: TKIF22 Mask                 */

#define TK_STA_TKIF23_Pos                (6)                                               /*!< TK_T::STA: TKIF23 Position             */
#define TK_STA_TKIF23_Msk                (0x1ul << TK_STA_TKIF23_Pos)                      /*!< TK_T::STA: TKIF23 Mask                 */

#define TK_STA_TKIF24_Pos                (7)                                               /*!< TK_T::STA: TKIF24 Position             */
#define TK_STA_TKIF24_Msk                (0x1ul << TK_STA_TKIF24_Pos)                      /*!< TK_T::STA: TKIF24 Mask                 */

#define TK_STA_TKIF25_Pos                (8)                                               /*!< TK_T::STA: TKIF25 Position             */
#define TK_STA_TKIF25_Msk                (0x1ul << TK_STA_TKIF25_Pos)                      /*!< TK_T::STA: TKIF25 Mask                 */

#define TK_DAT0_TKDAT0_Pos               (0)                                               /*!< TK_T::DAT0: TKDAT0 Position            */
#define TK_DAT0_TKDAT0_Msk               (0xfful << TK_DAT0_TKDAT0_Pos)                    /*!< TK_T::DAT0: TKDAT0 Mask                */

#define TK_DAT0_TKDAT1_Pos               (8)                                               /*!< TK_T::DAT0: TKDAT1 Position            */
#define TK_DAT0_TKDAT1_Msk               (0xfful << TK_DAT0_TKDAT1_Pos)                    /*!< TK_T::DAT0: TKDAT1 Mask                */

#define TK_DAT0_TKDAT2_Pos               (16)                                              /*!< TK_T::DAT0: TKDAT2 Position            */
#define TK_DAT0_TKDAT2_Msk               (0xfful << TK_DAT0_TKDAT2_Pos)                    /*!< TK_T::DAT0: TKDAT2 Mask                */

#define TK_DAT0_TKDAT3_Pos               (24)                                              /*!< TK_T::DAT0: TKDAT3 Position            */
#define TK_DAT0_TKDAT3_Msk               (0xfful << TK_DAT0_TKDAT3_Pos)                    /*!< TK_T::DAT0: TKDAT3 Mask                */

#define TK_DAT1_TKDAT4_Pos               (0)                                               /*!< TK_T::DAT1: TKDAT4 Position            */
#define TK_DAT1_TKDAT4_Msk               (0xfful << TK_DAT1_TKDAT4_Pos)                    /*!< TK_T::DAT1: TKDAT4 Mask                */

