ChibiOS/ChibiOS-Contrib/os/common/ext/CMSIS/Nuvoton/NUMICRO/M251/tk_reg.h
#define TK_DAT1_TKDAT5_Pos               (8)                                               /*!< TK_T::DAT1: TKDAT5 Position            */
#define TK_DAT1_TKDAT5_Msk               (0xfful << TK_DAT1_TKDAT5_Pos)                    /*!< TK_T::DAT1: TKDAT5 Mask                */

#define TK_DAT1_TKDAT6_Pos               (16)                                              /*!< TK_T::DAT1: TKDAT6 Position            */
#define TK_DAT1_TKDAT6_Msk               (0xfful << TK_DAT1_TKDAT6_Pos)                    /*!< TK_T::DAT1: TKDAT6 Mask                */

#define TK_DAT1_TKDAT7_Pos               (24)                                              /*!< TK_T::DAT1: TKDAT7 Position            */
#define TK_DAT1_TKDAT7_Msk               (0xfful << TK_DAT1_TKDAT7_Pos)                    /*!< TK_T::DAT1: TKDAT7 Mask                */

#define TK_DAT2_TKDAT8_Pos               (0)                                               /*!< TK_T::DAT2: TKDAT8 Position            */
#define TK_DAT2_TKDAT8_Msk               (0xfful << TK_DAT2_TKDAT8_Pos)                    /*!< TK_T::DAT2: TKDAT8 Mask                */

#define TK_DAT2_TKDAT9_Pos               (8)                                               /*!< TK_T::DAT2: TKDAT9 Position            */
#define TK_DAT2_TKDAT9_Msk               (0xfful << TK_DAT2_TKDAT9_Pos)                    /*!< TK_T::DAT2: TKDAT9 Mask                */

#define TK_DAT2_TKDAT10_Pos              (16)                                              /*!< TK_T::DAT2: TKDAT10 Position           */
#define TK_DAT2_TKDAT10_Msk              (0xfful << TK_DAT2_TKDAT10_Pos)                   /*!< TK_T::DAT2: TKDAT10 Mask               */

#define TK_DAT2_TKDAT11_Pos              (24)                                              /*!< TK_T::DAT2: TKDAT11 Position           */
#define TK_DAT2_TKDAT11_Msk              (0xfful << TK_DAT2_TKDAT11_Pos)                   /*!< TK_T::DAT2: TKDAT11 Mask               */

#define TK_DAT3_TKDAT12_Pos              (0)                                               /*!< TK_T::DAT3: TKDAT12 Position           */
#define TK_DAT3_TKDAT12_Msk              (0xfful << TK_DAT3_TKDAT12_Pos)                   /*!< TK_T::DAT3: TKDAT12 Mask               */

#define TK_DAT3_TKDAT13_Pos              (8)                                               /*!< TK_T::DAT3: TKDAT13 Position           */
#define TK_DAT3_TKDAT13_Msk              (0xfful << TK_DAT3_TKDAT13_Pos)                   /*!< TK_T::DAT3: TKDAT13 Mask               */

#define TK_DAT3_TKDAT14_Pos              (16)                                              /*!< TK_T::DAT3: TKDAT14 Position           */
#define TK_DAT3_TKDAT14_Msk              (0xfful << TK_DAT3_TKDAT14_Pos)                   /*!< TK_T::DAT3: TKDAT14 Mask               */

#define TK_DAT3_TKDAT15_Pos              (24)                                              /*!< TK_T::DAT3: TKDAT15 Position           */
#define TK_DAT3_TKDAT15_Msk              (0xfful << TK_DAT3_TKDAT15_Pos)                   /*!< TK_T::DAT3: TKDAT15 Mask               */

#define TK_DAT4_TKDAT16_Pos              (0)                                               /*!< TK_T::DAT4: TKDAT16 Position           */
#define TK_DAT4_TKDAT16_Msk              (0xfful << TK_DAT4_TKDAT16_Pos)                   /*!< TK_T::DAT4: TKDAT16 Mask               */

#define TK_DAT4_TKDAT_ALL_Pos            (8)                                               /*!< TK_T::DAT4: TKDAT_ALL Position         */
#define TK_DAT4_TKDAT_ALL_Msk            (0xfful << TK_DAT4_TKDAT_ALL_Pos)                 /*!< TK_T::DAT4: TKDAT_ALL Mask             */

#define TK_DAT5_TKDAT17_Pos              (0)                                               /*!< TK_T::DAT5: TKDAT17 Position           */
#define TK_DAT5_TKDAT17_Msk              (0xfful << TK_DAT5_TKDAT17_Pos)                   /*!< TK_T::DAT5: TKDAT17 Mask               */

#define TK_DAT5_TKDAT18_Pos              (8)                                               /*!< TK_T::DAT5: TKDAT18 Position           */
#define TK_DAT5_TKDAT18_Msk              (0xfful << TK_DAT5_TKDAT18_Pos)                   /*!< TK_T::DAT5: TKDAT18 Mask               */

#define TK_DAT5_TKDAT19_Pos              (16)                                              /*!< TK_T::DAT5: TKDAT19 Position           */
#define TK_DAT5_TKDAT19_Msk              (0xfful << TK_DAT5_TKDAT19_Pos)                   /*!< TK_T::DAT5: TKDAT19 Mask               */

#define TK_DAT5_TKDAT20_Pos              (24)                                              /*!< TK_T::DAT5: TKDAT20 Position           */
#define TK_DAT5_TKDAT20_Msk              (0xfful << TK_DAT5_TKDAT20_Pos)                   /*!< TK_T::DAT5: TKDAT20 Mask               */

#define TK_DAT6_TKDAT21_Pos              (0)                                               /*!< TK_T::DAT6: TKDAT21 Position           */
#define TK_DAT6_TKDAT21_Msk              (0xfful << TK_DAT6_TKDAT21_Pos)                   /*!< TK_T::DAT6: TKDAT21 Mask               */

#define TK_DAT6_TKDAT22_Pos              (8)                                               /*!< TK_T::DAT6: TKDAT22 Position           */
#define TK_DAT6_TKDAT22_Msk              (0xfful << TK_DAT6_TKDAT22_Pos)                   /*!< TK_T::DAT6: TKDAT22 Mask               */

#define TK_DAT6_TKDAT23_Pos              (16)                                              /*!< TK_T::DAT6: TKDAT23 Position           */
#define TK_DAT6_TKDAT23_Msk              (0xfful << TK_DAT6_TKDAT23_Pos)                   /*!< TK_T::DAT6: TKDAT23 Mask               */

#define TK_DAT6_TKDAT24_Pos              (24)                                              /*!< TK_T::DAT6: TKDAT24 Position           */
#define TK_DAT6_TKDAT24_Msk              (0xfful << TK_DAT6_TKDAT24_Pos)                   /*!< TK_T::DAT6: TKDAT24 Mask               */

#define TK_DAT7_TKDAT25_Pos              (0)                                               /*!< TK_T::DAT7: TKDAT25 Position           */
#define TK_DAT7_TKDAT25_Msk              (0xfful << TK_DAT7_TKDAT25_Pos)                   /*!< TK_T::DAT7: TKDAT25 Mask               */

#define TK_INTEN_SCTHIE_Pos              (0)                                               /*!< TK_T::INTEN: SCTHIE Position           */
#define TK_INTEN_SCTHIE_Msk              (0x1ul << TK_INTEN_SCTHIE_Pos)                    /*!< TK_T::INTEN: SCTHIE Mask               */

