ChibiOS/ChibiOS-Contrib/os/common/ext/CMSIS/Nuvoton/NUMICRO/M251/tk_reg.h
#define TK_THC1920_HTH20_Pos             (24)                                              /*!< TK_T::THC1920: HTH20 Position          */
#define TK_THC1920_HTH20_Msk             (0xfful << TK_THC1920_HTH20_Pos)                  /*!< TK_T::THC1920: HTH20 Mask              */

#define TK_THC2122_HTH21_Pos             (8)                                               /*!< TK_T::THC2122: HTH21 Position          */
#define TK_THC2122_HTH21_Msk             (0xfful << TK_THC2122_HTH21_Pos)                  /*!< TK_T::THC2122: HTH21 Mask              */

#define TK_THC2122_HTH22_Pos             (24)                                              /*!< TK_T::THC2122: HTH22 Position          */
#define TK_THC2122_HTH22_Msk             (0xfful << TK_THC2122_HTH22_Pos)                  /*!< TK_T::THC2122: HTH22 Mask              */

#define TK_THC2324_HTH23_Pos             (8)                                               /*!< TK_T::THC2324: HTH23 Position          */
#define TK_THC2324_HTH23_Msk             (0xfful << TK_THC2324_HTH23_Pos)                  /*!< TK_T::THC2324: HTH23 Mask              */

#define TK_THC2324_HTH24_Pos             (24)                                              /*!< TK_T::THC2324: HTH24 Position          */
#define TK_THC2324_HTH24_Msk             (0xfful << TK_THC2324_HTH24_Pos)                  /*!< TK_T::THC2324: HTH24 Mask              */

#define TK_THC25_HTH25_Pos               (8)                                               /*!< TK_T::THC25: HTH25 Position            */
#define TK_THC25_HTH25_Msk               (0xfful << TK_THC25_HTH25_Pos)                    /*!< TK_T::THC25: HTH25 Mask                */

#define TK_REFCBD0_CBD0_Pos              (0)                                               /*!< TK_T::REFCBD0: CBD0 Position           */
#define TK_REFCBD0_CBD0_Msk              (0xfful << TK_REFCBD0_CBD0_Pos)                   /*!< TK_T::REFCBD0: CBD0 Mask               */

#define TK_REFCBD0_CBD1_Pos              (8)                                               /*!< TK_T::REFCBD0: CBD1 Position           */
#define TK_REFCBD0_CBD1_Msk              (0xfful << TK_REFCBD0_CBD1_Pos)                   /*!< TK_T::REFCBD0: CBD1 Mask               */

#define TK_REFCBD0_CBD2_Pos              (16)                                              /*!< TK_T::REFCBD0: CBD2 Position           */
#define TK_REFCBD0_CBD2_Msk              (0xfful << TK_REFCBD0_CBD2_Pos)                   /*!< TK_T::REFCBD0: CBD2 Mask               */

#define TK_REFCBD0_CBD3_Pos              (24)                                              /*!< TK_T::REFCBD0: CBD3 Position           */
#define TK_REFCBD0_CBD3_Msk              (0xfful << TK_REFCBD0_CBD3_Pos)                   /*!< TK_T::REFCBD0: CBD3 Mask               */

#define TK_REFCBD1_CBD4_Pos              (0)                                               /*!< TK_T::REFCBD1: CBD4 Position           */
#define TK_REFCBD1_CBD4_Msk              (0xfful << TK_REFCBD1_CBD4_Pos)                   /*!< TK_T::REFCBD1: CBD4 Mask               */

#define TK_REFCBD1_CBD5_Pos              (8)                                               /*!< TK_T::REFCBD1: CBD5 Position           */
#define TK_REFCBD1_CBD5_Msk              (0xfful << TK_REFCBD1_CBD5_Pos)                   /*!< TK_T::REFCBD1: CBD5 Mask               */

#define TK_REFCBD1_CBD6_Pos              (16)                                              /*!< TK_T::REFCBD1: CBD6 Position           */
#define TK_REFCBD1_CBD6_Msk              (0xfful << TK_REFCBD1_CBD6_Pos)                   /*!< TK_T::REFCBD1: CBD6 Mask               */

#define TK_REFCBD1_CBD7_Pos              (24)                                              /*!< TK_T::REFCBD1: CBD7 Position           */
#define TK_REFCBD1_CBD7_Msk              (0xfful << TK_REFCBD1_CBD7_Pos)                   /*!< TK_T::REFCBD1: CBD7 Mask               */

#define TK_REFCBD2_CBD8_Pos              (0)                                               /*!< TK_T::REFCBD2: CBD8 Position           */
#define TK_REFCBD2_CBD8_Msk              (0xfful << TK_REFCBD2_CBD8_Pos)                   /*!< TK_T::REFCBD2: CBD8 Mask               */

#define TK_REFCBD2_CBD9_Pos              (8)                                               /*!< TK_T::REFCBD2: CBD9 Position           */
#define TK_REFCBD2_CBD9_Msk              (0xfful << TK_REFCBD2_CBD9_Pos)                   /*!< TK_T::REFCBD2: CBD9 Mask               */

#define TK_REFCBD2_CBD10_Pos             (16)                                              /*!< TK_T::REFCBD2: CBD10 Position          */
#define TK_REFCBD2_CBD10_Msk             (0xfful << TK_REFCBD2_CBD10_Pos)                  /*!< TK_T::REFCBD2: CBD10 Mask              */

#define TK_REFCBD2_CBD11_Pos             (24)                                              /*!< TK_T::REFCBD2: CBD11 Position          */
#define TK_REFCBD2_CBD11_Msk             (0xfful << TK_REFCBD2_CBD11_Pos)                  /*!< TK_T::REFCBD2: CBD11 Mask              */

#define TK_REFCBD3_CBD12_Pos             (0)                                               /*!< TK_T::REFCBD3: CBD12 Position          */
#define TK_REFCBD3_CBD12_Msk             (0xfful << TK_REFCBD3_CBD12_Pos)                  /*!< TK_T::REFCBD3: CBD12 Mask              */

#define TK_REFCBD3_CBD13_Pos             (8)                                               /*!< TK_T::REFCBD3: CBD13 Position          */
#define TK_REFCBD3_CBD13_Msk             (0xfful << TK_REFCBD3_CBD13_Pos)                  /*!< TK_T::REFCBD3: CBD13 Mask              */

#define TK_REFCBD3_CBD14_Pos             (16)                                              /*!< TK_T::REFCBD3: CBD14 Position          */
#define TK_REFCBD3_CBD14_Msk             (0xfful << TK_REFCBD3_CBD14_Pos)                  /*!< TK_T::REFCBD3: CBD14 Mask              */

#define TK_REFCBD3_CBD15_Pos             (24)                                              /*!< TK_T::REFCBD2: CBD15 Position          */
#define TK_REFCBD3_CBD15_Msk             (0xfful << TK_REFCBD3_CBD15_Pos)                  /*!< TK_T::REFCBD2: CBD15 Mask              */

