ChibiOS/ChibiOS-Contrib/os/common/ext/CMSIS/Nuvoton/NUMICRO/M251/tk_reg.h
#define TK_REFCBD4_CBD16_Pos             (0)                                               /*!< TK_T::REFCBD4: CBD16 Position          */
#define TK_REFCBD4_CBD16_Msk             (0xfful << TK_REFCBD4_CBD16_Pos)                  /*!< TK_T::REFCBD4: CBD16 Mask              */

#define TK_REFCBD4_CBD_ALL_Pos           (8)                                               /*!< TK_T::REFCBD4: CBD ALL Position        */
#define TK_REFCBD4_CBD_ALL_Msk           (0xfful << TK_REFCBD4_CBD_ALL_Pos)                /*!< TK_T::REFCBD4: CBD ALL Mask            */

#define TK_REFCBD5_CBD17_Pos             (0)                                               /*!< TK_T::REFCBD5: CBD17 Position          */
#define TK_REFCBD5_CBD17_Msk             (0xfful << TK_REFCBD5_CBD17_Pos)                  /*!< TK_T::REFCBD5: CBD17 Mask              */

#define TK_REFCBD5_CBD18_Pos             (8)                                               /*!< TK_T::REFCBD5: CBD18 Position          */
#define TK_REFCBD5_CBD18_Msk             (0xfful << TK_REFCBD5_CBD18_Pos)                  /*!< TK_T::REFCBD5: CBD18 Mask              */

#define TK_REFCBD5_CBD19_Pos             (16)                                              /*!< TK_T::REFCBD5: CBD19 Position          */
#define TK_REFCBD5_CBD19_Msk             (0xfful << TK_REFCBD5_CBD19_Pos)                  /*!< TK_T::REFCBD5: CBD19 Mask              */

#define TK_REFCBD5_CBD20_Pos             (24)                                              /*!< TK_T::REFCBD5: CBD20 Position          */
#define TK_REFCBD5_CBD20_Msk             (0xfful << TK_REFCBD5_CBD20_Pos)                  /*!< TK_T::REFCBD5: CBD10 Mask              */

#define TK_REFCBD6_CBD21_Pos             (0)                                               /*!< TK_T::REFCBD6: CBD21 Position          */
#define TK_REFCBD6_CBD21_Msk             (0xfful << TK_REFCBD6_CBD21_Pos)                  /*!< TK_T::REFCBD6: CBD21 Mask              */

#define TK_REFCBD6_CBD22_Pos             (8)                                               /*!< TK_T::REFCBD6: CBD22 Position          */
#define TK_REFCBD6_CBD22_Msk             (0xfful << TK_REFCBD6_CBD22_Pos)                  /*!< TK_T::REFCBD6: CBD22 Mask              */

#define TK_REFCBD6_CBD23_Pos             (16)                                              /*!< TK_T::REFCBD6: CBD23 Position          */
#define TK_REFCBD6_CBD23_Msk             (0xfful << TK_REFCBD6_CBD23_Pos)                  /*!< TK_T::REFCBD6: CBD23 Mask              */

#define TK_REFCBD6_CBD24_Pos             (24)                                              /*!< TK_T::REFCBD6: CBD24 Position          */
#define TK_REFCBD6_CBD24_Msk             (0xfful << TK_REFCBD6_CBD24_Pos)                  /*!< TK_T::REFCBD6: CBD24 Mask              */

#define TK_REFCBD7_CBD25_Pos             (0)                                               /*!< TK_T::REFCBD7: CBD25 Position          */
#define TK_REFCBD7_CBD25_Msk             (0xfful << TK_REFCBD7_CBD25_Pos)                  /*!< TK_T::REFCBD7: CBD25 Mask              */

/** @} TK_CONST */
/** @} end of TK register group */
/** @} end of REGISTER group */

#if defined ( __CC_ARM   )
    #pragma no_anon_unions
#endif

#endif /* __TK_REG_H__ */
